{
    "Lyrics": [
        [
            "[Verse 1]",
            "The Devil went down to Georgia",
            "He was lookin' for a soul to steal",
            "He was in a bind the way behind and willing to make a deal",
            "When he came across this young man pickin' a guitar and playin' it hot",
            "The Devil jumped up on a hickory stump and said, \"Boy, let me tell you what.\"",
            "\"I guess you didn't know it, but I'm a guitar player, too",
            "And if you'd care to take this dare I'll make a bet with you",
            "Now you a pretty damn good strummer, boy, but give the Devil his due",
            "I'll bet a guitar of gold against your soul that says I'm better than you\"",
            "",
            "But the boy said, \"My name's Johnny, and it might be a sin",
            "But I'll take your bet; you're gonna regret, I'm the best there's ever been.\"",
            "",
            "[Verse 2]",
            "The Devil opened up his case and he said, \"I'll start this show.\"",
            "And fire flew from his fingertips as he tuned his axe down low",
            "And he pulled that pick across the strings and it made an evil hiss",
            "Then a band of demons all joined in and it sounded just like this",
            "",
            "[Verse 3]",
            "When the Devil finished, Johnny said, \"Well, you're pretty good, old son",
            "Well sit your old ass in that chair right there, let me show you how the fuck it's done.\"",
            "",
            "[Verse 4]",
            "The Devil bowed his head because he knew that he'd been beat",
            "And he laid that gold guitar down on the ground at Johnny's feet",
            "But Johnny said, \"Devil, just come on back, if you ever wanna try again",
            "I done told you once, you son of a bitch, I'm the best that's ever been.\""
        ]
    ],
    "Comments": [],
    "Title": "Nickelback – The Devil Went Down to Georgia Lyrics | Genius Lyrics"
}