{
    "Lyrics": [
        [
            "[Verse 1]",
            "Addressing those beneath from high above",
            "Convincing his belief for what you love",
            "Baiting every hook with filthy lies",
            "Another charlatan to idolize",
            "",
            "[Pre-Chorus 1]",
            "Is this suppression just in my mind? (Just in my mind?)",
            "No more questions, get back in line! (Just get back in line!)",
            "",
            "[Chorus]",
            "You pay with your life",
            "The duller the knife, the longer it takes (The longer it takes)",
            "But now it's your turn",
            "The ashes will burn, and wither away",
            "Leaving your bones out on the stones, picking them clean (picking them clean)",
            "And carving the truth, while harvesting you to feed the machine (to feed the machine)",
            "",
            "[Verse 2]",
            "The gears forever turn to grind the mice",
            "Will you become the fuel for sacrifice?",
            "Power absolutely all for show",
            "The piper blows his flute and off you go",
            "",
            "[Pre-Chorus 2]",
            "Is this obsession behind your eyes? (Behind your eyes?)",
            "No more questions, get back in line! (Just get back in line!)",
            "",
            "[Chorus]",
            "You pay with your life",
            "The duller the knife, the longer it takes (The longer it takes)",
            "But now it's your turn",
            "The ashes will burn, and wither away",
            "Leaving your bones out on the stones, picking them clean (picking them clean)",
            "And carving the truth, while harvesting you to feed the machine (to feed the machine)",
            "",
            "[Bridge]",
            "Why must the blind always lead the blind?",
            "(Get back in line! Get back in line!)",
            "Why do I feel like the fault is mine?",
            "(Get back in line! Get back in line!)",
            "Why must the weakest be sacrificed?",
            "(Get back in line! Get back in line!)",
            "No more questions, get back in line!",
            "(Just get back in line!)",
            "",
            "[Chorus]",
            "Pay with your life",
            "The duller the knife, the longer it takes (The longer it takes)",
            "But now it's your turn",
            "The ashes will burn, and wither away (Wither away)",
            "Leaving your bones out on the stones, picking them clean (picking them clean)",
            "And carving the truth, while harvesting you to feed the machine (To feed the machine)",
            "To feed the machine"
        ]
    ],
    "Comments": [
        "“Feed the Machine” is the lead single and title track to Nickelback’s ninth studio album, which was released on June 16, 2017.",
        "The single was released on February 1, 2017, alongside the album information and a North American tour announcement.",
        "Speaking with HardDriveRadio, lead singer Chad Kroeger stated that the track had nothing to do with with the current political situations going on in the United States, and it was written long before Donald Trump took up the presidency.",
        "I know that a lot of people are going to think, especially with the climate right now in the US, that we are, you know, jumping on this political bandwagon. And everybody is weighing in on this thing, and there is, I mean, the division between right and left could not be further these days and everybody is just at each other’s throats over this thing. And it really had nothing to do with that. Because we started writing this song so long ago that your current president wasn’t even in the picture. So we need to spell that rumor right off the bat. Although, it lends itself well, very well. It really does to that thing, but it’s not because we want it to be this general metaphor for a lot of different things. Any time people follow something blindly, and there’s a reference to the piper blowing his flute that leads the mice kind of thing, and just away they go. There’s just so many of these things that people need to question. … There’s a thousand of these things that people just fall in line and all of those things are big machines. It’s also government, it’s also religion, it’s all of those things. The people just follow blindly just kinda asking questions, good questions. So it’s literally just that: it’s the conversation starter of “yeah, why do we do this? And why do we do that? Why do I smoke this and think it’s okay? Why do I eat that and think it’s alright? And why do I drive that and think it’s alright that it comes out of the ground and nothing’s gonna happen to the earth?” It’s all of those things ‘cause those are all machines that need consumers to feed them. And that’s really where we were coming from. We didn’t want it to be specific to anyone’s thing, so it left itself open to all of those topics."
    ],
    "Title": "Nickelback – Feed the Machine Lyrics | Genius Lyrics"
}