{
    "Lyrics": [
        [
            "[Verse 1]",
            "Look at this photograph",
            "Every time I do, it makes me laugh",
            "How did our eyes get so red?",
            "And what the hell is on Joey's head?",
            "And this is where I grew up",
            "I think the present owner fixed it up",
            "I never knew we ever went without",
            "The second floor is hard for sneaking out",
            "And this is where I went to school",
            "Most of the time had better things to do",
            "Criminal record says I broke in twice",
            "I must've done it half a dozen times",
            "I wonder if it's too late",
            "Should I go back and try to graduate?",
            "Life's better now than it was back then",
            "If I was them, I wouldn't let me in",
            "",
            "[Chorus]",
            "Oh, oh, oh",
            "Oh, God, I, I",
            "Every memory of looking out the back door",
            "I had the photo album spread out on my bedroom floor",
            "It's hard to say it, time to say it",
            "Goodbye, goodbye",
            "Every memory of walking out the front door",
            "I found the photo of the friend that I was looking for",
            "It's hard to say it, time to say it",
            "Goodbye, goodbye",
            "(Goodbye)",
            "",
            "[Verse 2]",
            "Remember the old arcade?",
            "Blew every dollar that we ever made",
            "The cops hated us hangin' out",
            "They say somebody went and burned it down",
            "We used to listen to the radio",
            "And sing along with every song we know",
            "We said someday we'd find out how it feels",
            "To sing to more than just the steering wheel",
            "Kim's the first girl I kissed",
            "I was so nervous that I nearly missed",
            "She's had a couple of kids since then",
            "I haven't seen her since God knows when",
            "",
            "[Chorus]",
            "Oh, oh, oh",
            "Oh, God, I, I",
            "Every memory of looking out the back door",
            "I had the photo album spread out on my bedroom floor",
            "It's hard to say it, time to say it",
            "Goodbye, goodbye",
            "Every memory of walking out the front door",
            "I found the photo of the friend that I was looking for",
            "It's hard to say it, time to say it",
            "Goodbye, goodbye",
            "",
            "[Bridge]",
            "I miss that town",
            "I miss their faces",
            "You can't erase",
            "You can't replace it",
            "I miss it now",
            "I can't believe it",
            "So hard to stay",
            "Too hard to leave it",
            "If I could, I'd relive those days",
            "I know the one thing that would never change",
            "",
            "[Chorus]",
            "Every memory of looking out the back door",
            "I had the photo album spread out on my bedroom floor",
            "It's hard to say it, time to say it",
            "Goodbye, goodbye",
            "Every memory of walking out the front door",
            "I found the photo of the friend that I was looking for",
            "It's hard to say it, time to say it",
            "Goodbye, goodbye",
            "",
            "[Outro]",
            "Look at this photograph",
            "Every time I do, it makes me laugh",
            "Every time I do, it makes me"
        ]
    ],
    "Comments": [
        "“Photograph” is a rock song recorded by Canadian rock band Nickelback, released as the lead single from their fifth studio album, All the Right Reasons.",
        "Lyrically, the song follows the narrator reminiscing about old memories and how much has changed since growing older.",
        "It’s just nostalgia, growing up in a small town, and you can’t go back to your childhood. Saying goodbye to friends that you’ve drifted away from, where you grew up, where you went to school, who you hung out with and the dumb stuff you used to do as a kid, the first love — all of those things. Everyone has one or two of those memories that they are fond of, so this song is really just the bridge for all that.\"",
        "The first line Kroeger wrote for the song ended up being song’s first line, “Look at this photograph.”",
        "The photograph I’m holding in the video is the photograph,“ he says. \"I just didn’t know where I was going with it, just spitting stuff out. Next thing I know, there was a line, ‘What the hell is on Joey’s head?”",
        "Chad Kroeger via cbc."
    ],
    "Title": "Nickelback – Photograph Lyrics | Genius Lyrics"
}