{
    "Lyrics": [
        [
            "[Verse 1]",
            "He's drunk again, it's time to fight",
            "She must have done something wrong tonight",
            "The living room becomes a boxing ring",
            "It's time to run when you see him",
            "Clenching his hands",
            "She's just a woman",
            "Never again",
            "",
            "[Verse 2]",
            "I hear her scream, from down the hall",
            "Amazing she can even talk at all",
            "She cries to me \"Go back to bed\"",
            "I'm terrified that she'll wind up",
            "Dead in his hands",
            "She's just a woman",
            "Never again",
            "",
            "[Chorus]",
            "Been there before, but not like this",
            "Seen it before, but not like this",
            "Never before have I ever",
            "Seen it this bad",
            "She's just a woman",
            "Never again",
            "",
            "[Verse 3]",
            "Just tell the nurse you slipped and fell",
            "It starts to sting as it starts to swell",
            "She looks at you, she wants the truth",
            "It's right out there in the waiting room",
            "With those hands",
            "Looking just as sweet as he can",
            "Never again",
            "",
            "[Chorus]",
            "Seen it before, but not like this",
            "Been there before, but not like this",
            "Never before have I ever",
            "Seen it this bad",
            "She's just a woman",
            "Never again",
            "Never again",
            "",
            "[Bridge]",
            "Father's a name you haven't earned yet",
            "You're just a child with a temper",
            "Haven't you heard \"Don't hit a lady\"?",
            "Kicking' your ass would be a pleasure",
            "",
            "[Verse 4]",
            "He's drunk again, it's time to fight",
            "Same old shit, just on a different night",
            "She grabs the gun, she's had enough",
            "Tonight she'll find out how fucking",
            "Tough is this man",
            "Pulls the trigger as fast as she can",
            "Never again",
            "",
            "[Chorus]",
            "Seen it before, but not like this",
            "Been there before, but not like this",
            "Never before have I ever",
            "Seen it this bad",
            "She's just a woman",
            "Never again",
            "Seen it before, but not like this",
            "Been there before, but not like this",
            "Never before have I ever",
            "Seen it this bad",
            "She's just a woman",
            "Never again",
            "Never again",
            "Never again",
            "Never again"
        ]
    ],
    "Comments": [
        "“Never Again” is the first track, and third single, off of Nickelback’s third album, Silver Side Up.",
        "The song tackles domestic violence through the perspective of a child. They see his mother being beaten by his drunk father with the mother telling them to go back to bed. The child has a hatred for their father, calling him a child with a temper and threatens to beat him for all the hurt he inflicted on their mother.",
        "After a hospital visit and subsequent release, the mother finally has enough of the father’s antics and shoots him dead in self-defense when he goes to beat her again, putting an end to the beatings.",
        "The single, released on July 2 2002, peaked at #1 on the Billboard Mainstream Rock Charts on October 5 2002 as well as charting in Canada, Ireland, Scotland, and the United Kingdom."
    ],
    "Title": "Nickelback – Never Again Lyrics | Genius Lyrics"
}